# ==================================
# Flaskの最初のテスト
# ==================================
# ----------------------------------
# import module
# ----------------------------------
from flask import Flask
from flask import render_template as rt

# --------------------------------
# 定義
# --------------------------------
app = Flask(__name__)

# rootからのURL経路と関数を紐付け
@app.route('/')
def hello():
	return rt('firstTest.html')


# --------------------------------
# メイン
# --------------------------------
if __name__ == '__main__':
	app.run()

