#!/usr/bin/env python
# -*- coding: utf-8 -*-
#======================================================================
#
# Flaskを使ったCSSの反映・JSの反映
#
#======================================================================
#----------------------------------------------------------------------
# import files
#----------------------------------------------------------------------
import pprint           # 出力文字列整形
import time             # 処理一時停止用
from flask import Flask # Webアプリ用マイクロフレームワーク
from flask import render_template as rt

#----------------------------------------------------------------------
# 定義
#----------------------------------------------------------------------
app = Flask(__name__)

@app.route("/")
def hello():
    aStr = '変数だよ'

    # htmlファイルはデフォルトで templates ディレクトリ内を探しに行く
    # aはhtml側で定義している変数反映のための文字列
    html = rt('index.html', a = aStr)
    return html


#----------------------------------------------------------------------
# 単体テスト
#----------------------------------------------------------------------
if __name__ == '__main__':
    app.run()
    input('ポーズ中、何か押すと進むよ...')

